package com.google;

public class Main {

    public static void main(String[] args) {




//        Задание 3
//        Применить на практике автоматическое преобразование, но с потерей точности: int -> float.
//        1. Проинициализировать переменную типа int максимальным значением
//        2. Присвоить ее значение переменной типа float.
//        3. Вывести оба числа на экран.

          int i = 2147483647;
          float f = (float)i;
          System.out.println(f);//2.14748365E9






    }
}
